Обработки/Reports/_АнкетаУчастникаРэнкингаНРА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_АнкетаУчастникаРэнкингаНРА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьРасшифровку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_АнкетаУчастникаРэнкингаНРА/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Анкета участника рэнкинга ""НРА""",
		"1.02",
		"",
		Истина
	);
		
	// Команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	Механизм = "ВнешнийОтчет._АнкетаУчастникаРэнкингаНРА.СформироватьОтчет()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ДокументРезультат.Очистить();
		
	Макет = ПолучитьМакет("Макет");
	ОбластьШапкаАктивы 				= Макет.ПолучитьОбласть("ШапкаАктивы");
	ОбластьСтрокаРаздел 			= Макет.ПолучитьОбласть("СтрокаРаздел");
	ОбластьСтрокаСчетДУ 			= Макет.ПолучитьОбласть("СтрокаСчетДУ");
	ОбластьШапкаКоличествоФондов 	= Макет.ПолучитьОбласть("ШапкаКоличествоФондов");
	ОбластьСобственныеСредства 		= Макет.ПолучитьОбласть("СобственныеСредства");
	
	ОбластьШапкаАктивы.Параметры.НачалоПериода = Формат(НачалоДня(ЭтотОбъект.Период.ДатаНачала), "ДФ=dd.MM.yyyy");
	ОбластьШапкаАктивы.Параметры.ОкончаниеПериода = Формат(НачалоДня(ЭтотОбъект.Период.ДатаОкончания), "ДФ=dd.MM.yyyy");
	
	ДокументРезультат.Вывести(ОбластьШапкаАктивы);
	
	ДанныеОтчета = ПолучитьДанныеОтчета();
	
	#Область Суммы_активов
	
	ВыборкаИтог = ДанныеОтчета.СуммыАктивов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаКвалифицированныхИнвесторов = Новый ТаблицаЗначений;
	ТаблицаКвалифицированныхИнвесторов.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаКвалифицированныхИнвесторов.Колонки.Добавить("СЧАКвал_НачалоПериода", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
	ТаблицаКвалифицированныхИнвесторов.Колонки.Добавить("СЧАКвал_ОкончаниеПериода", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
	
	Пока ВыборкаИтог.Следующий() Цикл
	
		ВыборкаСтрока = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаСтрока.Следующий() Цикл
			
			Префикс = ?(ВыборкаСтрока.НомерСтроки = 16, "СЧАКвал", "СЧА");
			
			Коллекция = ?(ВыборкаСтрока.НомерСтроки >= 15, ВыборкаИтог, ВыборкаСтрока);
			
			ОбластьСтрокаРаздел.Параметры.Значение_НачалоПериода = Формат(Коллекция[Префикс + "_НачалоПериода"], "ЧДЦ=2; ЧН=0; ЧГ=3,0");
			ОбластьСтрокаРаздел.Параметры.Значение_ОкончаниеПериода = Формат(Коллекция[Префикс + "_ОкончаниеПериода"], "ЧДЦ=2; ЧН=0; ЧГ=3,0");
			ОбластьСтрокаРаздел.Параметры.Наименование = ВыборкаСтрока.Наименование;
			
			ДокументРезультат.Вывести(ОбластьСтрокаРаздел);
			
			ДокументРезультат.НачатьГруппуСтрок();

			Если ВыборкаСтрока.НомерСтроки < 15 И ЭтотОбъект.ВыводитьРасшифровку Тогда // 15 - раздел ИТОГО, для него детали не нужны, 16 обрабатывается ниже
			
				ВыборкаСчетДУ = ВыборкаСтрока.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаСчетДУ.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ВыборкаСчетДУ.СчетДоверительногоУправления) Тогда
					
						ОбластьСтрокаСчетДУ.Параметры.Значение_НачалоПериода = Формат(ВыборкаСчетДУ[Префикс + "_НачалоПериода"], "ЧДЦ=2; ЧН=0; ЧГ=3,0");
						ОбластьСтрокаСчетДУ.Параметры.Значение_ОкончаниеПериода = Формат(ВыборкаСчетДУ[Префикс + "_ОкончаниеПериода"], "ЧДЦ=2; ЧН=0; ЧГ=3,0");
						ОбластьСтрокаСчетДУ.Параметры.СчетДоверительногоУправления = ВыборкаСчетДУ.СчетДоверительногоУправления;
						ДокументРезультат.Вывести(ОбластьСтрокаСчетДУ);
						
						Если ВыборкаСчетДУ.СЧАКвал_НачалоПериода + ВыборкаСчетДУ.СЧАКвал_ОкончаниеПериода > 0 Тогда
							ЗаполнитьЗначенияСвойств(ТаблицаКвалифицированныхИнвесторов.Добавить(), ВыборкаСчетДУ);
						КонецЕсли; 
					
					КонецЕсли; 
					
				КонецЦикла;		
				
			ИначеЕсли ВыборкаСтрока.НомерСтроки = 16 И ЭтотОбъект.ВыводитьРасшифровку Тогда 
				
				Для каждого Строка Из ТаблицаКвалифицированныхИнвесторов Цикл
				
					ОбластьСтрокаСчетДУ.Параметры.Значение_НачалоПериода = Формат(Строка[Префикс + "_НачалоПериода"], "ЧДЦ=2; ЧН=0; ЧГ=3,0");
					ОбластьСтрокаСчетДУ.Параметры.Значение_ОкончаниеПериода = Формат(Строка[Префикс + "_ОкончаниеПериода"], "ЧДЦ=2; ЧН=0; ЧГ=3,0");
					ОбластьСтрокаСчетДУ.Параметры.СчетДоверительногоУправления = Строка.СчетДоверительногоУправления;
					ДокументРезультат.Вывести(ОбластьСтрокаСчетДУ);
				
				КонецЦикла; 
				
			КонецЕсли;
			
			ДокументРезультат.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
	КонецЦикла;
	
	#КонецОбласти 
	
	#Область Количество_клиентов
	
	ОбластьШапкаКоличествоФондов.Параметры.НачалоПериода = Формат(НачалоДня(ЭтотОбъект.Период.ДатаНачала), "ДФ=dd.MM.yyyy");
	ОбластьШапкаКоличествоФондов.Параметры.ОкончаниеПериода = Формат(НачалоДня(ЭтотОбъект.Период.ДатаОкончания), "ДФ=dd.MM.yyyy");
	
	ДокументРезультат.Вывести(ОбластьШапкаКоличествоФондов);
	
	ВыборкаСтрока = ДанныеОтчета.КоличествоКлиентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтрока.Следующий() Цикл
		
		ОбластьСтрокаРаздел.Параметры.Значение_НачалоПериода = Формат(ВыборкаСтрока.КлиентНачалоПериода, "ЧДЦ=0; ЧН=0; ЧГ=3,0");
		ОбластьСтрокаРаздел.Параметры.Значение_ОкончаниеПериода = Формат(ВыборкаСтрока.КлиентОкончаниеПериода, "ЧДЦ=0; ЧН=0; ЧГ=3,0");
		ОбластьСтрокаРаздел.Параметры.Наименование = ВыборкаСтрока.Наименование;
		
		ДокументРезультат.Вывести(ОбластьСтрокаРаздел);
		
		ДокументРезультат.НачатьГруппуСтрок();
		
		ВыборкаСчетДУ = ВыборкаСтрока.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ЭтотОбъект.ВыводитьРасшифровку Тогда
		
			Пока ВыборкаСчетДУ.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаСчетДУ.СчетДоверительногоУправления) Тогда
				
					ОбластьСтрокаСчетДУ.Параметры.Значение_НачалоПериода = "";
					ОбластьСтрокаСчетДУ.Параметры.Значение_ОкончаниеПериода = "";
					ОбластьСтрокаСчетДУ.Параметры.СчетДоверительногоУправления = ВыборкаСчетДУ.СчетДоверительногоУправления;
							
					ДокументРезультат.Вывести(ОбластьСтрокаСчетДУ);				
				
				КонецЕсли; 
				
			КонецЦикла;
		
		КонецЕсли; 
		
		ДокументРезультат.ЗакончитьГруппуСтрок();

	КонецЦикла;
		
	#КонецОбласти 
	
	#Область Собственные_средства
	ОбластьСобственныеСредства.Параметры.ОкончаниеПериода = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьСобственныеСредства.Параметры.СобственныеСредства = ДанныеОтчета.СобственныеСредства;
	ДокументРезультат.Вывести(ОбластьСобственныеСредства);		
	#КонецОбласти 
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьДанныеОтчета(Макет = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	ПоследнийРабочийДеньНачалоПериода = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаНачала);
	ПоследнийРабочийДеньОкончаниеПериода = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаОкончания);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 							НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода", 						НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ПоследнийРабочийДеньНачалоПериода", 		ПоследнийРабочийДеньНачалоПериода);
	Запрос.УстановитьПараметр("ПоследнийРабочийДеньОкончаниеПериода", 	ПоследнийРабочийДеньОкончаниеПериода);
	
	#Область Текст_запроса_актуальные_счета_ДУ
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|	И (СчетаДоверительногоУправления.ДатаЗаключения <= &ОкончаниеПериода
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &НачалоПериода)
		|			ИЛИ СчетаДоверительногоУправления.ДатаЗаключения <= &ОкончаниеПериода
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &ОкончаниеПериода))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК Период
		|ПОМЕСТИТЬ _ДатаПервойОперации
		|ИЗ
		|	_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	МИНИМУМ(ВложенныйЗапрос.Период)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ПО ОстаткиДенежныхСредств.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|				И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		ОстаткиДенежныхСредств.Активность
		|		И ОстаткиДенежныхСредств.Период <= КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|		ОстаткиЦенныхБумаг.Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ПО ОстаткиЦенныхБумаг.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|				И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		ОстаткиЦенныхБумаг.Активность
		|		И ОстаткиЦенныхБумаг.Период <= КОНЕЦПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ДатаПервойОперации.Период КАК ДатаЗаключения,
		|	_СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _АктуальныеСчетаДоверительногоУправления
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатаПервойОперации КАК _ДатаПервойОперации
		|		ПО _СчетаДоверительногоУправления.Ссылка = _ДатаПервойОперации.СчетДоверительногоУправления";
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"УНИЧТОЖИТЬ _СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатаПервойОперации";
	Запрос.Выполнить();
	#КонецОбласти 
	
	#Область Даты_расчета_СЧА
	ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос, НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос, НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыРасчетаСЧАНачалоПериода.Организация КАК Организация,
		|	_ДатыРасчетаСЧАНачалоПериода.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыРасчетаСЧАНачалоПериода.Дата КАК Дата,
		|	""НачалоПериода"" КАК КолонкаОтчета,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	ЕСТЬNULL(КвалифицированныеИнвесторыСрезПоследних.Является
		|			ИЛИ КвалифицированныеИнвесторыСрезПоследних.ВСилуЗакона, ЛОЖЬ) КАК ЯвляетсяКвалифицированнымИнвестором,
		|	ПаевыеИнвестиционныеФонды.Тип КАК ТипПИФ
		|ПОМЕСТИТЬ _ДатыРасчетаСЧА
		|ИЗ
		|	_ДатыРасчетаСЧАНачалоПериода КАК _ДатыРасчетаСЧАНачалоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&НачалоПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО _ДатыРасчетаСЧАНачалоПериода.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПаевыеИнвестиционныеФонды.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КвалифицированныеИнвесторы.СрезПоследних(&НачалоПериода, ) КАК КвалифицированныеИнвесторыСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = КвалифицированныеИнвесторыСрезПоследних.ЮрФизЛицо
		|				И (КвалифицированныеИнвесторыСрезПоследних.Организация = _ДатыРасчетаСЧАНачалоПериода.Организация
		|					ИЛИ КвалифицированныеИнвесторыСрезПоследних.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыРасчетаСЧАОкончаниеПериода.Организация,
		|	_ДатыРасчетаСЧАОкончаниеПериода.СчетДоверительногоУправления,
		|	_ДатыРасчетаСЧАОкончаниеПериода.Дата,
		|	""ОкончаниеПериода"",
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	ЕСТЬNULL(КвалифицированныеИнвесторыСрезПоследних.Является
		|			ИЛИ КвалифицированныеИнвесторыСрезПоследних.ВСилуЗакона, ЛОЖЬ),
		|	ПаевыеИнвестиционныеФонды.Тип
		|ИЗ
		|	_ДатыРасчетаСЧАОкончаниеПериода КАК _ДатыРасчетаСЧАОкончаниеПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ОкончаниеПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО _ДатыРасчетаСЧАОкончаниеПериода.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПаевыеИнвестиционныеФонды.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КвалифицированныеИнвесторы.СрезПоследних(&ОкончаниеПериода, ) КАК КвалифицированныеИнвесторыСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = КвалифицированныеИнвесторыСрезПоследних.ЮрФизЛицо
		|				И (КвалифицированныеИнвесторыСрезПоследних.Организация = _ДатыРасчетаСЧАОкончаниеПериода.Организация
		|					ИЛИ КвалифицированныеИнвесторыСрезПоследних.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)))";
	
	Запрос.Выполнить();		
	#КонецОбласти 
		
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ДатыРасчетаСЧА.Клиент КАК Клиент,
		|	ЕСТЬNULL(СЧА.Значение, 0) КАК СЧА,
		|	_ДатыРасчетаСЧА.КолонкаОтчета КАК КолонкаОтчета,
		|	_ДатыРасчетаСЧА.ЯвляетсяКвалифицированнымИнвестором КАК ЯвляетсяКвалифицированнымИнвестором,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ВЫБОР
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ В (ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый), ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный))
		|						ТОГДА 1
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)
		|						ТОГДА 2
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
		|						ТОГДА 3
		|				КОНЕЦ
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА 4
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА 5
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА 6
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|			ТОГДА 7
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА 8
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА 9
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ТОГДА 10
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
		|			ТОГДА 12
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|			ТОГДА 14
		|		ИНАЧЕ 13
		|	КОНЕЦ КАК СтрокаОтчетаСЧА,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ВЫБОР
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
		|						ТОГДА 1
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
		|						ТОГДА 2
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Интервальный)
		|						ТОГДА 3
		|					КОГДА _ДатыРасчетаСЧА.ТипПИФ = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Биржевой)
		|						ТОГДА 4
		|				КОНЕЦ
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов))
		|			ТОГДА 5
		|		КОГДА _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА 6
		|		КОГДА НЕ _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|			ТОГДА 7
		|	КОНЕЦ КАК СтрокаОтчетаКоличество
		|ПОМЕСТИТЬ _ДанныеОтчетаПоПериодам
		|ИЗ
		|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыРасчетаСЧА КАК _ДатыРасчетаСЧА
		|		ПО _СчетаДоверительногоУправления.Организация = _ДатыРасчетаСЧА.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = _ДатыРасчетаСЧА.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.СубъектАналитики = _ДатыРасчетаСЧА.СчетДоверительногоУправления)
		|			И (СЧА.Период = _ДатыРасчетаСЧА.Дата)
		|			И (СЧА.Организация = _ДатыРасчетаСЧА.Организация)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_ДанныеОтчетаНачало.СчетДоверительногоУправления, _ДанныеОтчетаОкончание.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	_ДанныеОтчетаНачало.Клиент КАК КлиентНачалоПериода,
		|	ЕстьNULL(_ДанныеОтчетаНачало.СЧА, 0) КАК СЧАНачалоПериода,
		|	ЕстьNULL(_ДанныеОтчетаНачало.ЯвляетсяКвалифицированнымИнвестором, Ложь) КАК ЯвляетсяКвалифицированнымИнвесторомНачалоПериода,
		|	ЕСТЬNULL(_ДанныеОтчетаНачало.СтрокаОтчетаСЧА, _ДанныеОтчетаОкончание.СтрокаОтчетаСЧА) КАК СтрокаОтчетаСЧА,
		|	ЕСТЬNULL(_ДанныеОтчетаНачало.СтрокаОтчетаКоличество, _ДанныеОтчетаОкончание.СтрокаОтчетаКоличество) КАК СтрокаОтчетаКоличество,
		|	_ДанныеОтчетаОкончание.Клиент КАК КлиентОкончаниеПериода,
		|	ЕСТЬNULL(_ДанныеОтчетаОкончание.СЧА, 0) КАК СЧАОкончаниеПериода,
		|	ЕстьNULL(_ДанныеОтчетаОкончание.ЯвляетсяКвалифицированнымИнвестором, ЛОЖЬ) КАК ЯвляетсяКвалифицированнымИнвесторомОкончаниеПериода
		|ПОМЕСТИТЬ _ДанныеОтчета
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДанныеОтчетаПоПериодам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ДанныеОтчетаПоПериодам.Клиент КАК Клиент,
		|		_ДанныеОтчетаПоПериодам.СЧА КАК СЧА,
		|		_ДанныеОтчетаПоПериодам.КолонкаОтчета КАК КолонкаОтчета,
		|		_ДанныеОтчетаПоПериодам.ЯвляетсяКвалифицированнымИнвестором КАК ЯвляетсяКвалифицированнымИнвестором,
		|		_ДанныеОтчетаПоПериодам.СтрокаОтчетаСЧА КАК СтрокаОтчетаСЧА,
		|		_ДанныеОтчетаПоПериодам.СтрокаОтчетаКоличество КАК СтрокаОтчетаКоличество
		|	ИЗ
		|		_ДанныеОтчетаПоПериодам КАК _ДанныеОтчетаПоПериодам
		|	ГДЕ
		|		_ДанныеОтчетаПоПериодам.КолонкаОтчета = ""НачалоПериода"") КАК _ДанныеОтчетаНачало
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДанныеОтчетаПоПериодам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ДанныеОтчетаПоПериодам.Клиент КАК Клиент,
		|			_ДанныеОтчетаПоПериодам.СЧА КАК СЧА,
		|			_ДанныеОтчетаПоПериодам.КолонкаОтчета КАК КолонкаОтчета,
		|			_ДанныеОтчетаПоПериодам.ЯвляетсяКвалифицированнымИнвестором КАК ЯвляетсяКвалифицированнымИнвестором,
		|			_ДанныеОтчетаПоПериодам.СтрокаОтчетаСЧА КАК СтрокаОтчетаСЧА,
		|			_ДанныеОтчетаПоПериодам.СтрокаОтчетаКоличество КАК СтрокаОтчетаКоличество
		|		ИЗ
		|			_ДанныеОтчетаПоПериодам КАК _ДанныеОтчетаПоПериодам
		|		ГДЕ
		|			_ДанныеОтчетаПоПериодам.КолонкаОтчета = ""ОкончаниеПериода"") КАК _ДанныеОтчетаОкончание
		|		ПО _ДанныеОтчетаНачало.СчетДоверительногоУправления = _ДанныеОтчетаОкончание.СчетДоверительногоУправления";
	
	Запрос.Выполнить();
	
	#КонецОбласти 
	
	#Область Данные_отчета
	
	ТаблицаРазделов = ПолучитьТаблицуРазделов(Макет);
	Запрос.УстановитьПараметр("ТаблицаРазделов", ТаблицаРазделов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаРазделов.Наименование КАК Наименование,
		|	ТаблицаРазделов.Раздел КАК Раздел,
		|	ТаблицаРазделов.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ _ТаблицаРазделов
		|ИЗ
		|	&ТаблицаРазделов КАК ТаблицаРазделов";
	Запрос.Выполнить();	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаРазделов.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаРазделов.Наименование КАК Наименование,
		|	_ДанныеОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ДанныеОтчета.СЧАНачалоПериода, 0) КАК СЧА_НачалоПериода,
		|	ЕСТЬNULL(_ДанныеОтчета.СЧАОкончаниеПериода, 0) КАК СЧА_ОкончаниеПериода,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.ЯвляетсяКвалифицированнымИнвесторомНачалоПериода
		|			ТОГДА _ДанныеОтчета.СЧАНачалоПериода
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СЧАКвал_НачалоПериода,
		|	ВЫБОР
		|		КОГДА _ДанныеОтчета.ЯвляетсяКвалифицированнымИнвесторомОкончаниеПериода
		|			ТОГДА _ДанныеОтчета.СЧАОкончаниеПериода
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СЧАКвал_ОкончаниеПериода
		|ИЗ
		|	_ТаблицаРазделов КАК _ТаблицаРазделов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеОтчета КАК _ДанныеОтчета
		|		ПО _ТаблицаРазделов.НомерСтроки = _ДанныеОтчета.СтрокаОтчетаСЧА
		|ГДЕ
		|	_ТаблицаРазделов.Раздел = ""Активы""
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	СчетДоверительногоУправления
		|ИТОГИ
		|	МАКСИМУМ(Наименование),
		|	СУММА(СЧА_НачалоПериода),
		|	СУММА(СЧА_ОкончаниеПериода),
		|	СУММА(СЧАКвал_НачалоПериода),
		|	СУММА(СЧАКвал_ОкончаниеПериода)
		|ПО
		|	ОБЩИЕ,
		|	НомерСтроки,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаРазделов.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаРазделов.Наименование КАК Наименование,
		|	ЕСТЬNULL(_ДанныеОтчета.КлиентНачалоПериода, _ДанныеОтчета.КлиентОкончаниеПериода) КАК СчетДоверительногоУправления,
		|	_ДанныеОтчета.КлиентНачалоПериода КАК КлиентНачалоПериода,
		|	_ДанныеОтчета.КлиентОкончаниеПериода КАК КлиентОкончаниеПериода
		|ИЗ
		|	_ТаблицаРазделов КАК _ТаблицаРазделов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеОтчета КАК _ДанныеОтчета
		|		ПО _ТаблицаРазделов.НомерСтроки = _ДанныеОтчета.СтрокаОтчетаКоличество
		|ГДЕ
		|	_ТаблицаРазделов.Раздел = ""КоличествоФондов""
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	СчетДоверительногоУправления
		|ИТОГИ
		|	МАКСИМУМ(Наименование),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлиентНачалоПериода),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлиентОкончаниеПериода)
		|ПО
		|	НомерСтроки,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	#КонецОбласти 
	
	ДанныеОтчета = Новый Структура("СуммыАктивов, КоличествоКлиентов", 
		ПакетРезультатов[0],
		ПакетРезультатов[1]);
		
	СобственныеСредства = РаботаСВнешнимиСистемами.ПолучитьСтоимостьСобственныхСредствИзБухгалтерии(ЭтотОбъект.Организация, ЭтотОбъект.Период.ДатаОкончания);
	ДанныеОтчета.Вставить("СобственныеСредства", СобственныеСредства);
	
	#Область Данные_о_компании
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименование,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ВебСтраница КАК Сайт,
		|	ЕСТЬNULL(ВложенныйЗапрос.Значение, """") КАК ДатаОснования
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&ТекущаяДата,
		|			ЮрФизЛицо = &ЮрЛицоОрганизации
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И Организация = &Организация) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗначенияДополнительныхСведений.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ГДЕ
		|			ЗначенияДополнительныхСведений.Объект = &Организация
		|			И ЗначенияДополнительныхСведений.Свойство.Ключ = ""ДатаОснованияКомпании"") КАК ВложенныйЗапрос
		|		ПО (ИСТИНА)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ДанныеОКомпании = Новый Структура;
	ДанныеОКомпании.Вставить("ДатаЗаполнения", 		Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"));
	ДанныеОКомпании.Вставить("ОтветственноеЛицо", 	РаботаСПользователями.ТекущийПользователь().Наименование);
	ДанныеОКомпании.Вставить("ПолноеНаименование", 	Выборка.ПолноеНаименование);
	ДанныеОКомпании.Вставить("ИНН", 				Выборка.ИНН);
	ДанныеОКомпании.Вставить("ДатаОснования", 		Выборка.ДатаОснования);
	ДанныеОКомпании.Вставить("Сайт", 				Выборка.Сайт);
	
	ДанныеОтчета.Вставить("ДанныеОКомпании", ДанныеОКомпании);		
	#КонецОбласти 
	
	Возврат ДанныеОтчета;

КонецФункции

Процедура ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос, ДатаРасчетаСЧА)

	Если ДатаРасчетаСЧА = НачалоДня(ЭтотОбъект.Период.ДатаНачала) Тогда
		ПодстрокаПериод = "НачалоПериода";
	Иначе
		ПодстрокаПериод = "ОкончаниеПериода";
	КонецЕсли; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	&ДатаС КАК ДатаНачала,
		|	&ДатаПо КАК ДатаОкончания
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаС", 	"&ПоследнийРабочийДень" + ПодстрокаПериод);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПо", "&" + ПодстрокаПериод);
	
	Запрос.Выполнить();
	
	ПараметрыДатСЧА = Новый Структура("ВидДействия, ДополнитьРабочимиДнями, ИмяТаблицыДатДействияЗаПериод, УдалитьВсеВременныеТаблицы", 
									"СЧА", Истина, "_ВсеДатыРасчетаСЧА", Истина);
	
	Запрос.Текст = Справочники.НастройкиРегламентныхДействий.ПолучитьТекстЗапросаПоДатамРегламентныхДействий(ПараметрыДатСЧА);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаС", 	"&ПоследнийРабочийДень" + ПодстрокаПериод);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПо", "&" + ПодстрокаПериод);
	
	Запрос.Выполнить();
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеДатыРасчетаСЧА.Организация КАК Организация,
		|	_ВсеДатыРасчетаСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(_ВсеДатыРасчетаСЧА.Дата) КАК Дата
		|ПОМЕСТИТЬ _ДатыРасчетаСЧА
		|ИЗ
		|	_ВсеДатыРасчетаСЧА КАК _ВсеДатыРасчетаСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВсеДатыРасчетаСЧА.СчетДоверительногоУправления,
		|	_ВсеДатыРасчетаСЧА.Организация";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ДатыРасчетаСЧА", "_ДатыРасчетаСЧА" + ПодстрокаПериод);
	
	Запрос.Выполнить();
	
	Запрос.Текст = 	
		"УНИЧТОЖИТЬ _ДатыДействияРазвернуто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеДатыРасчетаСЧА";
		
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики() Экспорт
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", 	ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("ДатаНачала", 		ЭтотОбъект.Период.ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаОкончания", 	ЭтотОбъект.Период.ДатаОкончания);
	ПараметрыОтчета.Вставить("Версия", 			СведенияОВнешнейОбработке().Версия);
	
	Описание = "";
	
	Для каждого Параметр Из ПараметрыОтчета Цикл
	
		Описание = Описание + Символы.ПС + Параметр.Ключ + ": " + Параметр.Значение;
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

Функция ПолучитьТаблицуРазделов(Макет = Неопределено)

	Если Макет = Неопределено Тогда
		Макет = ПолучитьМакет("Макет");
	КонецЕсли; 
	
	ТаблицаРазделов = Новый ТаблицаЗначений;
	ТаблицаРазделов.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)));
	ТаблицаРазделов.Колонки.Добавить("Раздел", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ТаблицаРазделов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	ОбластьРазделыАктивы = Макет.ПолучитьОбласть("РазделыАктивы");
	ОбластьРазделыКоличествоФондов = Макет.ПолучитьОбласть("РазделыКоличествоФондов");
	
	ДобавитьСтрокиВТаблицуРазделов(ТаблицаРазделов, ОбластьРазделыАктивы, "Активы");
	ДобавитьСтрокиВТаблицуРазделов(ТаблицаРазделов, ОбластьРазделыКоличествоФондов, "КоличествоФондов");
	
	Возврат ТаблицаРазделов;

КонецФункции
 
Процедура ДобавитьСтрокиВТаблицуРазделов(ТаблицаРазделов, Область, Раздел)

	Для НомерСтроки = 1 По Область.ВысотаТаблицы Цикл
	
		НоваяСтрока = ТаблицаРазделов.Добавить();
		НоваяСтрока.Наименование = Область.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		НоваяСтрока.Раздел = Раздел;
		НоваяСтрока.НомерСтроки = НомерСтроки;
	
	КонецЦикла; 

КонецПроцедуры
